# questions.py

QUIZ_DATA = [
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-1?",
        "options": ['лицевой счет', 'расчетная ведомость', 'прием на работу', 'расчетно-платежная ведомость'],
        "correct_index": 2
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-1a?",
        "options": ['прием на работу', 'расчетная ведомость', 'командировка работников', 'прием на работу сотрудников'],
        "correct_index": 3
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-2?",
        "options": ['увольнение работников', 'личная карточка', 'Приказ (распоряжение) о переводе работников на другую работу', 'лицевой счет'],
        "correct_index": 1
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-3?",
        "options": ['личная карточка', 'штатное расписание', 'служебное задание', 'расчетная ведомость'],
        "correct_index": 1
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-4?",
        "options": ['прием на работу', 'отпуск + по уходу за реб + б/с+отпуск сотрудников', 'платежная ведомость', 'Учетная карточка научного, научно-педагогического работника'],
        "correct_index": 3
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-5?",
        "options": ['прием на работу сотрудников', 'перевод на другую работу', 'расчет увольнения', 'командировочное удостоверение'],
        "correct_index": 1
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-5a?",
        "options": ['расчетная ведомость', 'Приказ (распоряжение) о переводе работников на другую работу', 'прием на работу', 'графики отпусков'],
        "correct_index": 1
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-6?",
        "options": ['табель', 'отпуск + по уходу за реб + б/с+отпуск сотрудников', 'перевод на другую работу', 'личная карточка'],
        "correct_index": 1
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-6a?",
        "options": ['премия, приз, подарок', 'графики отпусков', 'личная карточка', 'отпуск сотрудников'],
        "correct_index": 3
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-7?",
        "options": ['графики отпусков', 'табель с зарплатой', 'расчет увольнения', 'командировка работников'],
        "correct_index": 0
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-8?",
        "options": ['увольнение', 'прием на работу сотрудников', 'командировка работников', 'личная карточка'],
        "correct_index": 0
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-8a?",
        "options": ['премия, приз, подарок', 'Приказ (распоряжение) о переводе работников на другую работу', 'штатное расписание', 'увольнение работников'],
        "correct_index": 3
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-9?",
        "options": ['командировка', 'табель с зарплатой', 'табель', 'штатное расписание'],
        "correct_index": 0
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-9a?",
        "options": ['штатное расписание', 'расчет отпуска', 'командировка работников', 'увольнение'],
        "correct_index": 2
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-10?",
        "options": ['увольнение', 'командировочное удостоверение', 'табель', 'командировка работников'],
        "correct_index": 1
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-10a?",
        "options": ['служебное задание', 'расчетно-платежная ведомость', 'увольнение', 'командировка'],
        "correct_index": 0
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-11?",
        "options": ['штатное расписание', 'табель с зарплатой', 'лицевой счет', 'премия, приз, подарок'],
        "correct_index": 3
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-11a?",
        "options": ['премия, приз, подарок на список сотрудников', 'личная карточка', 'Учетная карточка научного, научно-педагогического работника', 'командировка'],
        "correct_index": 0
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-12?",
        "options": ['табель с зарплатой', 'расчет отпуска', 'штатное расписание', 'лицевой счет'],
        "correct_index": 0
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-13?",
        "options": ['табель', 'увольнение', 'табель с зарплатой', 'расчетная ведомость'],
        "correct_index": 0
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-49?",
        "options": ['расчетно-платежная ведомость', 'прием на работу сотрудников', 'Учетная карточка научного, научно-педагогического работника', 'увольнение работников'],
        "correct_index": 0
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-51?",
        "options": ['расчет отпуска', 'прием на работу', 'расчетная ведомость', 'табель с зарплатой'],
        "correct_index": 2
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-53?",
        "options": ['платежная ведомость', 'графики отпусков', 'увольнение', 'Учетная карточка научного, научно-педагогического работника'],
        "correct_index": 0
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-54?",
        "options": ['расчетная ведомость', 'лицевой счет', 'Приказ (распоряжение) о переводе работников на другую работу', 'прием на работу'],
        "correct_index": 1
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-60?",
        "options": ['табель с зарплатой', 'прием на работу сотрудников', 'лицевой счет', 'расчет отпуска'],
        "correct_index": 3
    },
    {
        "question": "Какая унифицированная форма имеет кодовое обозначение Т-61?",
        "options": ['расчетная ведомость', 'служебное задание', 'расчет отпуска', 'расчет увольнения'],
        "correct_index": 3
    },
]
